podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/DMATRIGMUX_LPC82x.svd.xml
<!--
Devices using this peripheral: 
      LPC82x
-->
      <peripheral>
         <?sourceFile "DMATRIGMUX_LPC82x" ?>
         <name>DMATRIGMUX</name>
         <description>DMA trigger mux</description>
         <groupName>DMATRIGMUX</groupName>
         <headerStructName>DMATRIGMUX</headerStructName>
         <baseAddress>0x40028000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x48</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DMA_ITRIG_INMUX0</name>
               <description>Input mux register for trigger inputs 0 to 23 connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin  interrupts, and DMA requests</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0xF</resetValue>
               <fields>
                  <field>
                     <name>INP</name>
                     <description>Trigger input number (decimal value) for DMA channel n (n = 0 to 8). All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_SEQA_IRQ</name>
                           <description>ADC_SEQA_IRQ</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_SEQB_IRQ</name>
                           <description>ADC_SEQB_IRQ</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA0</name>
                           <description>SCT_DMA0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA1</name>
                           <description>SCT_DMA1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_O</name>
                           <description>ACMP_O</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT0</name>
                           <description>PININT0</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT1</name>
                           <description>PININT1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_0</name>
                           <description>DMA trigger mux 0. (DMA_INMUX_INMUX0)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_1</name>
                           <description>DMA trigger mux 1. (DMA_INMUX_INMUX1)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_ITRIG_INMUX1</name>
               <description>Input mux register for trigger inputs 0 to 23 connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin  interrupts, and DMA requests</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0xF</resetValue>
               <fields>
                  <field>
                     <name>INP</name>
                     <description>Trigger input number (decimal value) for DMA channel n (n = 0 to 8). All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_SEQA_IRQ</name>
                           <description>ADC_SEQA_IRQ</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_SEQB_IRQ</name>
                           <description>ADC_SEQB_IRQ</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA0</name>
                           <description>SCT_DMA0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA1</name>
                           <description>SCT_DMA1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_O</name>
                           <description>ACMP_O</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT0</name>
                           <description>PININT0</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT1</name>
                           <description>PININT1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_0</name>
                           <description>DMA trigger mux 0. (DMA_INMUX_INMUX0)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_1</name>
                           <description>DMA trigger mux 1. (DMA_INMUX_INMUX1)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_ITRIG_INMUX2</name>
               <description>Input mux register for trigger inputs 0 to 23 connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin  interrupts, and DMA requests</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0xF</resetValue>
               <fields>
                  <field>
                     <name>INP</name>
                     <description>Trigger input number (decimal value) for DMA channel n (n = 0 to 8). All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_SEQA_IRQ</name>
                           <description>ADC_SEQA_IRQ</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_SEQB_IRQ</name>
                           <description>ADC_SEQB_IRQ</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA0</name>
                           <description>SCT_DMA0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA1</name>
                           <description>SCT_DMA1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_O</name>
                           <description>ACMP_O</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT0</name>
                           <description>PININT0</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT1</name>
                           <description>PININT1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_0</name>
                           <description>DMA trigger mux 0. (DMA_INMUX_INMUX0)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_1</name>
                           <description>DMA trigger mux 1. (DMA_INMUX_INMUX1)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_ITRIG_INMUX3</name>
               <description>Input mux register for trigger inputs 0 to 23 connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin  interrupts, and DMA requests</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0xF</resetValue>
               <fields>
                  <field>
                     <name>INP</name>
                     <description>Trigger input number (decimal value) for DMA channel n (n = 0 to 8). All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_SEQA_IRQ</name>
                           <description>ADC_SEQA_IRQ</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_SEQB_IRQ</name>
                           <description>ADC_SEQB_IRQ</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA0</name>
                           <description>SCT_DMA0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA1</name>
                           <description>SCT_DMA1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_O</name>
                           <description>ACMP_O</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT0</name>
                           <description>PININT0</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT1</name>
                           <description>PININT1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_0</name>
                           <description>DMA trigger mux 0. (DMA_INMUX_INMUX0)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_1</name>
                           <description>DMA trigger mux 1. (DMA_INMUX_INMUX1)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>14</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>4,5,6,7,8,9,10,11,12,13,14,15,16,17</dimIndex>
               <name>DMA_ITRIG_INMUX%s</name>
               <description>Input mux register for trigger inputs 0 to 23 connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin  interrupts, and DMA requests</description>
               <addressOffset>0x10</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>INP</name>
                     <description>Trigger input number (decimal value) for DMA channel n (n = 0 to 8). All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_SEQA_IRQ</name>
                           <description>ADC_SEQA_IRQ</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_SEQB_IRQ</name>
                           <description>ADC_SEQB_IRQ</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA0</name>
                           <description>SCT_DMA0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCT_DMA1</name>
                           <description>SCT_DMA1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_O</name>
                           <description>ACMP_O</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT0</name>
                           <description>PININT0</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PININT1</name>
                           <description>PININT1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_0</name>
                           <description>DMA trigger mux 0. (DMA_INMUX_INMUX0)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_TRIGGER_MUX_1</name>
                           <description>DMA trigger mux 1. (DMA_INMUX_INMUX1)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
